mathematical_program.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MathematicalProgram Tutorial</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">MathematicalProgram Tutorial</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb2e90f2">Background</a></li>
<li><a href="#org0780dc3">Basics of MathematicalProgram class</a>
<ul>
<li><a href="#org9a52351">Initialize a MathematicalProgram object</a></li>
<li><a href="#org1f03204">Adding decision variables</a></li>
<li><a href="#org6c86819">Adding constraints</a>
<ul>
<li><a href="#org0cd56cf">AddConstraint</a></li>
</ul>
</li>
<li><a href="#org8c013f1">Adding Cost functions</a>
<ul>
<li><a href="#org127e6ba">AddCost method</a></li>
</ul>
</li>
<li><a href="#org6fc1f79">Solve the optimization problem</a>
<ul>
<li><a href="#org025db52">Automatically choosing a solver</a></li>
<li><a href="#org54ab120">Manually choosing a solver</a></li>
</ul>
</li>
<li><a href="#org3f36e72">Using an initial guess</a></li>
</ul>
</li>
<li><a href="#org77d8b8a">Add callback</a></li>
<li><a href="#org3051a1c">Advanced tutorials</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb2e90f2" class="outline-2">
<h2 id="orgb2e90f2">Background</h2>
<div class="outline-text-2" id="text-orgb2e90f2">
<p>
Many engineering problems can be formulated as mathematical optimization
problems, and solved by numerical solvers. A generic mathematical
optimization problem can be formulated as
</p>

<p>
\(\begin{aligned} \begin{array}{rl}  \min_x \; & f(x)  \\\text{subject to} \; & x \in\mathcal{S}  \end{array}  \qquad  \boxed{  \begin{array}{ll}  \text{The real-valued decision variable is} &x\\  \text{The real-valued cost function is} &f(x)\\  \text{The constraint set is} &\mathcal{S}\\  \text{The optimal } x \text{ that minimizes the cost function is} &x^*  \end{array}  } \end{aligned}\)
</p>

<p>
where \(x\) is the real-valued decision variable(s), \(f(x)\) is the
real-valued <i>cost function</i>, \(\mathcal{S}\) is the constraint set for
\(x\). Our goal is to find the optimal \(x^*\) within the constraint set
\(\mathcal{S}\), such that \(x^*\) minimizes the cost function \(f(x)\).
</p>

<p>
For example, the following optimization problem determines the value of
\(x\) that minimizes \(x^3 + 2x + 1\) subject to \(x \ge 1\).
\(\begin{aligned} \begin{array}{rl} \min_x\;&x^3 + 2x + 1\\ \text{subject to}\;\;&x \ge 1 \end{array} \quad \boxed{  \begin{array}{ll}  \text{The real-valued decision variable is} & x\\  \text{The real-valued cost function }f(x) \text{ is} & x^3 + 2x + 1\\  \text{The set }\mathcal{S} \text{ of constraints is} & x \ge 1\\  \text{The value that minimizes the cost function is} & x^* = 1  \end{array} } \end{aligned}\)
</p>

<p>
In general, how an optimization problem is solved depends on its
categorization (categories include Linear Programming, Quadratic
Programming, Mixed-integer Programming, etc.). Categorization depends on
properties of both the cost function \(f(x)\) and the constraint set
\(\mathcal{S}\). For example, if the cost function \(f(x)\) is a linear
function of \(x\), and the constraint \(\mathcal{S}\) is a linear set
\(\mathcal{S} = \{x | Ax\le b\}\), then we have a <i>linear programming</i>
problem, which is efficiently solved with certain solvers.
</p>

<p>
There are multiple solvers for each category of optimization problems,
but each solver has its own API and data structures. Frequently, users
need to rewrite code when they switch solvers. To remedy this, Drake
provides a common API through the <i>MathematicalProgram</i> class. In
addition to avoiding solver-specific code, the constraint and cost
functions can be written in symbolic form (which makes code more
readable). In these ways, Drake's MathematicalProgram is akin to
<a href="https://yalmip.github.io/">YALMIP</a> in MATLAB or
<a href="https://github.com/JuliaOpt/JuMP.jl">JuMP</a> in Julia, and we support
both Python and C++. Note: Drake supports many
<a href="https://drake.mit.edu/doxygen_cxx/group__solvers.html">solvers</a> (some
are open-source and some require a license).
</p>

<p>
Drake can formulate and solve the following categories of optimization
problems
</p>
<ul class="org-ul">
<li>Linear programming</li>
<li>Quadratic programming</li>
<li>Second-order cone programming</li>
<li>Nonlinear nonconvex programming</li>
<li>Semidefinite programming</li>
<li>Sum-of-squares programming</li>
<li>Mixed-integer programming (mixed-integer linear programming, mixed-integer quadratic programming, mixed-integer second-order cone programming).</li>
<li>Linear complementarity problem</li>
</ul>

<p>
This tutorial provides the basics of Drake's MathematicalProgram.
Advanced tutorials are available at the <a href="#org3051a1c">bottom</a> of this document.
</p>
</div>
</div>

<div id="outline-container-org0780dc3" class="outline-2">
<h2 id="org0780dc3">Basics of MathematicalProgram class</h2>
<div class="outline-text-2" id="text-org0780dc3">
<p>
Drake's MathematicalProgram class contains the mathematical formulation of an optimization problem,
namely the decision variables \(x\), the cost function \(f(x)\), and the constraint set \(\mathcal{S}\).
</p>
</div>

<div id="outline-container-org9a52351" class="outline-3">
<h3 id="org9a52351">Initialize a MathematicalProgram object</h3>
<div class="outline-text-3" id="text-org9a52351">
<p>
To initialize this class, first create an empty MathematicalProgram as
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #005F00;">"drake/solvers/mathematical_program.h"</span>
<span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">...</span>
<span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::<span style="color: #1F55A0;">MathematicalProgram</span> <span style="color: #004651;">prog</span>;
<span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">...</span>
</pre>
</div>
</div>
</div>
