mathematical_program.org
** Adding decision variables
Shown below, the function ~NewContinuousVariables~ adds two new continuous decision variables to ~prog~.  The newly added variables are returned as ~x~ (~VectorXDecisionVariable~).
Note the range of the variable is a continuous set, as opposed to binary variables which only take discrete value 0 or 1.

The default names of the variable in *x* are "x(0)" and "x(1)".  The next line prints the default names and types in ~x~,
whereas the second line prints the symbolic expression "1 + 2x[0] + 3x[1] + 4x[1]".

#+begin_src cpp
  auto x = prog.NewContinuousVariables(2);
  std::cout << x << "\n";
  /**
   ,* Output:
   ,* x(0)
   ,* x(1)
   ,*/

  std::cout << 1 + 2 * x[0] + 3 * x[1] + 4 * x[1] << "\n";
  /**
   ,* Output:
   ,* (1 + 2 * x(0) + 7 * x(1))
   ,*/
#+end_src

To create an array ~y~ of two variables named "dog(0)"" and "dog(1)", pass the name "dog" as a second argument to ~NewContinuousVariables()~.
Also shown below is the printout of the two variables in ~y~ and a symbolic expression involving ~y~.

#+begin_src cpp
  auto y = prog.NewContinuousVariables(2, "dog");
  std::cout << y << "\n";
  /**
   ,* Output:
   ,* dog(0)
   ,* dog(1)
   ,*/

  std::cout << y[0] + y[0] + y[1] * y[1] * y[1] << "\n";
  /**
   ,* Output:
   ,* (2 * dog(0) + pow(dog(1), 3))
   ,*/
#+end_src

To create a $3 \times 2$ matrix of variables named "A", type

#+begin_src cpp
  auto var_matrix = prog.NewContinuousVariables(3, 2, "A");
  std::cout << var_matrix << "\n";
  /**
   ,* Output:
   ,* A(0,0) A(0,1)
   ,* A(1,0) A(1,1)
   ,* A(2,0) A(2,1)
   ,*/
#+end_src


** Adding constraints
There are many ways to impose constraints on the decision variables. This tutorial shows a few simple examples.
Refer to the links at the [[*Advanced tutorials][bottom]] of this document for other types of constraints.

*** AddConstraint
The simplest way to add a constraint is with ~MathematicalProgram.AddConstraint()~.
#+begin_src cpp
  // Add an equality constraint
  prog.AddConstraint(x[0] * x[1] == 1)
#+end_src


You can also add inequality constraints to `prog` such as
#+begin_src cpp
  // Add inequality constraints
  prog.AddConstraint(x[0] >= 0);
  prog.AddConstraint(x[0] - x[1] <= 0);
#+end_src
** Adding Cost functions
In a complicated optimization problem, it is often convenient to write the total cost function $f(x)$ as a sum of individual cost functions

$\begin{aligned}
f(x) = \sum_i g_i(x)
\end{aligned}$

*** AddCost method
The simplest way to add an individual cost function $g_i(x)$ to the total cost function $f(x)$ is with the ~MathematicalProgram.AddCost()~ method (as shown below).
#+begin_src cpp
  // Add a cost x(0)**2 + 3 to the total cost. Since prog doesn't have a cost before, now the total cost is x(0)**2 + 3
  prog.AddCost(x[0] ** 2 + 3);
#+end_src

To add another individual cost function $x(0) + x(1)$ to the total cost function $f(x)$, simply call ~AddCost()~ again as follows
#+begin_src cpp
  prog.AddCost(x[0] + x[1]);
#+end_src

now the total cost function becomes $x(0)^2 + x(0) + x(1) + 3$.

~prog~ can analyze each of these individual cost functions and determine that $x(0) ^ 2 + 3$  is a convex quadratic function, and $x(0) + x(1)$ is a linear function of $x$.

** Solve the optimization problem
Once all the decision variables/constraints/costs are added to ~prog~, we are ready to solve the optimization problem.
