mathematical_program.html

<div id="outline-container-org1f03204" class="outline-3">
<h3 id="org1f03204">Adding decision variables</h3>
<div class="outline-text-3" id="text-org1f03204">
<p>
Shown below, the function <code>NewContinuousVariables</code> adds two new continuous decision variables to <code>prog</code>.  The newly added variables are returned as <code>x</code> (<code>VectorXDecisionVariable</code>).
Note the range of the variable is a continuous set, as opposed to binary variables which only take discrete value 0 or 1.
</p>

<p>
The default names of the variable in <b>x</b> are "x(0)" and "x(1)".  The next line prints the default names and types in <code>x</code>,
whereas the second line prints the symbolic expression "1 + 2x[0] + 3x[1] + 4x[1]".
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #D70000;">auto</span> <span style="color: #004651;">x</span> = prog.NewContinuousVariables<span style="color: #1F55A0;">(</span><span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #1F55A0;">)</span>;
<span style="color: #AF005F;">std</span>::cout &lt;&lt; x &lt;&lt; <span style="color: #005F00;">"\n"</span>;
<span style="color: #004700; font-style: italic;">/**</span>
<span style="color: #004700; font-style: italic;"> * </span><span style="color: #AF005F; font-style: italic;">Output</span><span style="color: #004700; font-style: italic;">:</span>
<span style="color: #004700; font-style: italic;"> * x(0)</span>
<span style="color: #004700; font-style: italic;"> * x(1)</span>
<span style="color: #004700; font-style: italic;"> */</span>

<span style="color: #AF005F;">std</span>::cout &lt;&lt; <span style="color: #D75F00; font-weight: bold;">1</span> + <span style="color: #D75F00; font-weight: bold;">2</span> * x<span style="color: #1F55A0;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #1F55A0;">]</span> + <span style="color: #D75F00; font-weight: bold;">3</span> * x<span style="color: #1F55A0;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #1F55A0;">]</span> + <span style="color: #D75F00; font-weight: bold;">4</span> * x<span style="color: #1F55A0;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #1F55A0;">]</span> &lt;&lt; <span style="color: #005F00;">"\n"</span>;
<span style="color: #004700; font-style: italic;">/**</span>
<span style="color: #004700; font-style: italic;"> * </span><span style="color: #AF005F; font-style: italic;">Output</span><span style="color: #004700; font-style: italic;">:</span>
<span style="color: #004700; font-style: italic;"> * (1 + 2 * x(0) + 7 * x(1))</span>
<span style="color: #004700; font-style: italic;"> */</span>
</pre>
</div>

<p>
To create an array <code>y</code> of two variables named "dog(0)"" and "dog(1)", pass the name "dog" as a second argument to <code>NewContinuousVariables()</code>.
Also shown below is the printout of the two variables in <code>y</code> and a symbolic expression involving <code>y</code>.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #D70000;">auto</span> <span style="color: #004651;">y</span> = prog.NewContinuousVariables<span style="color: #1F55A0;">(</span><span style="color: #D75F00; font-weight: bold;">2</span>, <span style="color: #005F00;">"dog"</span><span style="color: #1F55A0;">)</span>;
<span style="color: #AF005F;">std</span>::cout &lt;&lt; y &lt;&lt; <span style="color: #005F00;">"\n"</span>;
<span style="color: #004700; font-style: italic;">/**</span>
<span style="color: #004700; font-style: italic;"> * </span><span style="color: #AF005F; font-style: italic;">Output</span><span style="color: #004700; font-style: italic;">:</span>
<span style="color: #004700; font-style: italic;"> * dog(0)</span>
<span style="color: #004700; font-style: italic;"> * dog(1)</span>
<span style="color: #004700; font-style: italic;"> */</span>

<span style="color: #AF005F;">std</span>::cout &lt;&lt; y<span style="color: #1F55A0;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #1F55A0;">]</span> + y<span style="color: #1F55A0;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #1F55A0;">]</span> + y<span style="color: #1F55A0;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #1F55A0;">]</span> * y<span style="color: #1F55A0;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #1F55A0;">]</span> * y<span style="color: #1F55A0;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #1F55A0;">]</span> &lt;&lt; <span style="color: #005F00;">"\n"</span>;
<span style="color: #004700; font-style: italic;">/**</span>
<span style="color: #004700; font-style: italic;"> * </span><span style="color: #AF005F; font-style: italic;">Output</span><span style="color: #004700; font-style: italic;">:</span>
<span style="color: #004700; font-style: italic;"> * (2 * dog(0) + pow(dog(1), 3))</span>
<span style="color: #004700; font-style: italic;"> */</span>
</pre>
</div>

<p>
To create a \(3 \times 2\) matrix of variables named "A", type
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #D70000;">auto</span> <span style="color: #004651;">var_matrix</span> = prog.NewContinuousVariables<span style="color: #1F55A0;">(</span><span style="color: #D75F00; font-weight: bold;">3</span>, <span style="color: #D75F00; font-weight: bold;">2</span>, <span style="color: #005F00;">"A"</span><span style="color: #1F55A0;">)</span>;
<span style="color: #AF005F;">std</span>::cout &lt;&lt; var_matrix &lt;&lt; <span style="color: #005F00;">"\n"</span>;
<span style="color: #004700; font-style: italic;">/**</span>
<span style="color: #004700; font-style: italic;"> * </span><span style="color: #AF005F; font-style: italic;">Output</span><span style="color: #004700; font-style: italic;">:</span>
<span style="color: #004700; font-style: italic;"> * A(0,0) A(0,1)</span>
<span style="color: #004700; font-style: italic;"> * A(1,0) A(1,1)</span>
<span style="color: #004700; font-style: italic;"> * A(2,0) A(2,1)</span>
<span style="color: #004700; font-style: italic;"> */</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org6c86819" class="outline-3">
<h3 id="org6c86819">Adding constraints</h3>
<div class="outline-text-3" id="text-org6c86819">
<p>
There are many ways to impose constraints on the decision variables. This tutorial shows a few simple examples.
Refer to the links at the <a href="#org3051a1c">bottom</a> of this document for other types of constraints.
</p>
</div>

<div id="outline-container-org0cd56cf" class="outline-4">
<h4 id="org0cd56cf">AddConstraint</h4>
<div class="outline-text-4" id="text-org0cd56cf">
<p>
The simplest way to add a constraint is with <code>MathematicalProgram.AddConstraint()</code>.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">Add an equality constraint</span>
prog.AddConstraint<span style="color: #1F55A0;">(</span>x<span style="color: #AF005F;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #AF005F;">]</span> * x<span style="color: #AF005F;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #AF005F;">]</span> == <span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #1F55A0;">)</span>
</pre>
</div>


<p>
You can also add inequality constraints to `prog` such as
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">Add inequality constraints</span>
prog.AddConstraint<span style="color: #1F55A0;">(</span>x<span style="color: #AF005F;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #AF005F;">]</span> &gt;= <span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #1F55A0;">)</span>;
prog.AddConstraint<span style="color: #1F55A0;">(</span>x<span style="color: #AF005F;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #AF005F;">]</span> - x<span style="color: #AF005F;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #AF005F;">]</span> &lt;= <span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #1F55A0;">)</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8c013f1" class="outline-3">
<h3 id="org8c013f1">Adding Cost functions</h3>
<div class="outline-text-3" id="text-org8c013f1">
<p>
In a complicated optimization problem, it is often convenient to write the total cost function \(f(x)\) as a sum of individual cost functions
</p>

<p>
\(\begin{aligned}
f(x) = \sum_i g_i(x)
\end{aligned}\)
</p>
</div>

<div id="outline-container-org127e6ba" class="outline-4">
<h4 id="org127e6ba">AddCost method</h4>
<div class="outline-text-4" id="text-org127e6ba">
<p>
The simplest way to add an individual cost function \(g_i(x)\) to the total cost function \(f(x)\) is with the <code>MathematicalProgram.AddCost()</code> method (as shown below).
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">Add a cost x(0)**2 + 3 to the total cost. Since prog doesn't have a cost before, now the total cost is x(0)**2 + 3</span>
prog.AddCost<span style="color: #1F55A0;">(</span>x<span style="color: #AF005F;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #AF005F;">]</span> ** <span style="color: #D75F00; font-weight: bold;">2</span> + <span style="color: #D75F00; font-weight: bold;">3</span><span style="color: #1F55A0;">)</span>;
</pre>
</div>

<p>
To add another individual cost function \(x(0) + x(1)\) to the total cost function \(f(x)\), simply call <code>AddCost()</code> again as follows
</p>
<div class="org-src-container">
<pre class="src src-cpp">prog.AddCost<span style="color: #1F55A0;">(</span>x<span style="color: #AF005F;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #AF005F;">]</span> + x<span style="color: #AF005F;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #AF005F;">]</span><span style="color: #1F55A0;">)</span>;
</pre>
</div>

<p>
now the total cost function becomes \(x(0)^2 + x(0) + x(1) + 3\).
</p>

<p>
<code>prog</code> can analyze each of these individual cost functions and determine that \(x(0) ^ 2 + 3\)  is a convex quadratic function, and \(x(0) + x(1)\) is a linear function of \(x\).
</p>
</div>
</div>
</div>

<div id="outline-container-org6fc1f79" class="outline-3">
<h3 id="org6fc1f79">Solve the optimization problem</h3>
<div class="outline-text-3" id="text-org6fc1f79">
<p>
Once all the decision variables/constraints/costs are added to <code>prog</code>, we are ready to solve the optimization problem.
</p>
</div>
