mathematical_program.html
<div id="outline-container-org025db52" class="outline-4">
<h4 id="org025db52">Automatically choosing a solver</h4>
<div class="outline-text-4" id="text-org025db52">
<p>
The simplest way to solve the optimization problem is to call <code>Solve()</code> function. Drake's MathematicalProgram analyzes the type of the constraints/costs,
and then calls an appropriate solver for your problem. The result of calling `Solve()` is stored inside the return argument. Here is a code snippet
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">drake/solvers/mathematical_program.h</span><span style="color: #1F55A0;">&gt;</span>
<span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">drake/solvers/solve.h</span><span style="color: #1F55A0;">&gt;</span>

<span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">iostream</span><span style="color: #1F55A0;">&gt;</span>

<span style="color: #D70000;">template</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #D70000;">typename</span>... <span style="color: #1F55A0;">Args</span><span style="color: #1F55A0;">&gt;</span>
<span style="color: #1F55A0;">void</span> <span style="color: #AF8700;">print</span><span style="color: #1F55A0;">(</span><span style="color: #1F55A0;">Args</span>&amp;&amp;... <span style="color: #004651;">value</span><span style="color: #1F55A0;">)</span> <span style="color: #1F55A0;">{</span>
  <span style="color: #AF005F;">(</span><span style="color: #AF005F;">std</span>::cout &lt;&lt; ... &lt;&lt; value<span style="color: #AF005F;">)</span> &lt;&lt; <span style="color: #005F00;">"\n---\n"</span>;
<span style="color: #1F55A0;">}</span>

<span style="color: #1F55A0;">int</span> <span style="color: #AF8700;">main</span><span style="color: #1F55A0;">(</span><span style="color: #1F55A0;">int</span> <span style="color: #004651;">argc</span>, <span style="color: #1F55A0;">char</span>* <span style="color: #004651;">argv</span><span style="color: #AF005F;">[]</span><span style="color: #1F55A0;">)</span> <span style="color: #1F55A0;">{</span>
  <span style="color: #4E4E4E; font-style: italic;">/*</span>
<span style="color: #4E4E4E; font-style: italic;">   * Solves a simple optimization problem</span>
<span style="color: #4E4E4E; font-style: italic;">   *    min x(0)^2 + x(1)^2</span>
<span style="color: #4E4E4E; font-style: italic;">   * subject to x(0) + x(1) = 1</span>
<span style="color: #4E4E4E; font-style: italic;">   *        x(0) &lt;= x(1)</span>
<span style="color: #4E4E4E; font-style: italic;">   */</span>
  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">Set up the optimization problem.</span>
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">prog</span> = <span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::MathematicalProgram<span style="color: #AF005F;">()</span>;
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">x</span> = prog.NewContinuousVariables<span style="color: #AF005F;">(</span><span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #AF005F;">)</span>;
  prog.AddConstraint<span style="color: #AF005F;">(</span>x<span style="color: #005F00;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #005F00;">]</span> + x<span style="color: #005F00;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #005F00;">]</span> == <span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #AF005F;">)</span>;
  prog.AddConstraint<span style="color: #AF005F;">(</span>x<span style="color: #005F00;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #005F00;">]</span> &lt;= x<span style="color: #005F00;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #005F00;">]</span><span style="color: #AF005F;">)</span>;
  prog.AddCost<span style="color: #AF005F;">(</span>pow<span style="color: #005F00;">(</span>x<span style="color: #8700AF;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #8700AF;">]</span>, <span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #005F00;">)</span> + pow<span style="color: #005F00;">(</span>x<span style="color: #8700AF;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #8700AF;">]</span>, <span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #005F00;">)</span><span style="color: #AF005F;">)</span>;

  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">Now solve the optimization problem.</span>
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">result</span> = <span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::Solve<span style="color: #AF005F;">(</span>prog<span style="color: #AF005F;">)</span>;

  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">print out the result.</span>
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"Success? "</span>, result.is_success<span style="color: #005F00;">()</span><span style="color: #AF005F;">)</span>;
  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">Print the solution to the decision variables.</span>
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"x* = "</span>, result.GetSolution<span style="color: #005F00;">(</span>x<span style="color: #005F00;">)</span><span style="color: #AF005F;">)</span>;
  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">Print the optimal cost.</span>
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"optimal cost = "</span>, result.get_optimal_cost<span style="color: #005F00;">()</span><span style="color: #AF005F;">)</span>;
  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">Print the name of the solver that was called.</span>
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"solver is: "</span>, result.get_solver_id<span style="color: #005F00;">()</span>.name<span style="color: #005F00;">()</span><span style="color: #AF005F;">)</span>;
  <span style="color: #D70000;">return</span> <span style="color: #D75F00; font-weight: bold;">0</span>;
<span style="color: #1F55A0;">}</span>
</pre>
</div>

<p>
Notice that we can then retrieve optimization result from the return argument of <code>Solve</code>. For example, the solution \(x^*\) is retrieved from <code>result.GetSolution()</code>,
and the optimal cost from <code>result.get_optimal_cost()</code>. To play around with it, <a href="https://github.com/Maverobot/docker-compiler-explorer-drake#usage">launch compiler-explorer locally</a> and click <a href="http://localhost:10240/#z:OYLghAFBqd5QCxAYwPYBMCmBRdBLAF1QCcAaPECAMzwBtMA7AQwFtMQByARg9KtQYEAysib0QXACx8BBAKoBnTAAUAHpwAMvAFYTStJg1DIApACYAQuYukl9ZATwDKjdAGFUtAK4sGIMwAcpK4AMngMmAByPgBGmMQS0gAOqAqETgwe3r7%2BQSlpjgJhEdEscQlStpj2hQxCBEzEBFk%2BfoFVNRn1jQTFUbHxibYNTS057QojveH9ZYNSAJS2qF7EyOwc5gDM4cjeWADUJltu6MRMANaYAPQKngBu8QrXLEwECJivjqK0APpJxFQwHOLAAdAhjtgTBoAILbXb7TBHE5nS43O60R7EZ4Yx7gyHQuGw%2BEMPZeQ7HNxOSbETCsAnE2EET5JAzM5FuAgATySjFYmFBgoOMOIwAUDJh91QeHQBwB4QIEBFYvMADY1YLQQd7mIvJgFkcAOxWWEHA4QSboEAoFYEDmUg6a%2B0nbW6/XOtxHMxmEwAVjcDAAtMG/QHzD6tia4YaACKEwkKg6vcIQRONYDIUgHZAIRoAKgO6fufqsvpjBpMxsJZuueerZoLQgemAUhYOaRYrKRqCSjhYeAAXm8MnLATF6Cx6wcC2ak%2BEDqoIBoFn7sGYvRYFxAuCvfWupwWFF4YtpMA4DkQt8uN1ud8iYwcuAfZy%2BrxWTscH4udwfrvXrtcBxCJgdpeEkF4fAcPZ9oOw4CKOqDjp8oL1kwXiXgCQL3gcqJXNauJPNaACybwfF8eA/MogLAqwEArpGqHoagC7YZhwCgpEmAAO4eII4ReCsCgAGqNHgTBIQoEBmPRUZmvKggQOGqjYeGWaqDJjGXmgDA0kwCpcKx1GgjC6DuAIukKhAqglhofoPtYC4lk%2BZb3p%2Bj4aaao6WeG2kWYIXAgF6ZhZr5BDnPpHkwmaaFaeZYV6YI65uWxxmmbxfmKtZvoWLZLmUm5WUWM55bHLJXkKT5cXhYlgWqdmVUJQQ0mlZpzFoJMBnJUZJlmZMEApFxVk2XZWbSTeA1DdlxWjQskVycQ3neu1BABUFIWpCtkX/oBkSoFx7bNhB3a9ng/ZDrUCFIWCrUHLSR60Habm4ewIAEdi1pNpimD9dRW2eQB5V2raR23S2XgPShnnyYq4ZCF4yDrAoCi1d6WZ3eDBCgngCi/EeCMtpJs0tf9gFUYm7xIhi6EjpeFM4We2MjjqC3ifQCiQ1FgOKd6qgFm5dXoxDADiIGfdTAhWUTDEkwcZOCCD0GnWI9WTBz82LWYiuvLQKuPVs9mo6D92Y8AIG/FrYi/MtdFzQcANy3adPMGwUFUCDb0QW8BxcUwrY/PQ6Bq1z4Ye9jKPBUbGOgqbBC482xC/DKdGgs731S2VtIEKsDAHLZ0vRnGsIcEstCcL6vB%2BBwWikKgnBuNYDl3Ks6xelsPCkAQmjF0sFwgL6kighoqpbAAnIakgBGYI%2B%2BoavpmJI0ilxwkgV13NecLwyMaB3XdLHAsBIGgnZ0PE5CUEfSQnwkwAj3wdDMu9EAxGvMThI0XKcO3R9sIIADyDC0A/lXXgWBXhGHEMA0g%2BBaQODwI8ZGkDMCqDPOhDY1cFTVDXrQPAMRzjEC5B4LAa8wqnU/sXPgBgxRCTwNxX%2BvJK7t34IIEQYh2CVCYfIJQag166C4PoQwxgG6WH0Dg5GsBU4gEwHgU2DBSBYk4FsLYhpyEQAkc9ORgxuBcC0LNGuJ1zKcEDJaT8phLDWC4MojoZ5aguAYGZbIfg%2BGhBmKUcoeh8jpAEGMRxpAPG1D6K4%2BYVjYECG6KMTwrQ9B2GsV0KYASBgVGGD0bxUS4kuISRIJYTc1hsI7rSDYPAS5l1XpA2uHBgBCM3CPc09czHCIOLgQgJBW58IOB4Y%2B9BiAtIWLwTuwC95IFtEkdCZ8IAXyvnoTA%2BAiCJI4Sw8Q7DZCKBUOoSBYVMAFN4Fxc4SQyFFI4OXUgldq5lN/uhYZQM3YVLqVUmpqAOnxG6b03ePcQCSF9KCEeWxVQaDML6CxGhJDz1nqqfQnAV6kBYBIDQ29jm8DKZvPQfSdH7LMCUk5G8d79KWFiNIzhJBAA%3D">here</a>.
</p>

<p>
Some optimization solution is infeasible (doesn't have a solution). For example in the following code example, <code>result.get_solution_result()</code> will not report <code>kSolutionFound</code>.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4E4E4E; font-style: italic;">/*</span>
<span style="color: #4E4E4E; font-style: italic;"> * An infeasible optimization problem.</span>
<span style="color: #4E4E4E; font-style: italic;"> */</span>
<span style="color: #D70000;">auto</span> <span style="color: #004651;">prog</span> = MathematicalProgram<span style="color: #1F55A0;">()</span>;
<span style="color: #D70000;">auto</span> <span style="color: #004651;">x</span> = prog.NewContinuousVariables<span style="color: #1F55A0;">(</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #1F55A0;">)[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #1F55A0;">]</span>;
<span style="color: #D70000;">auto</span> <span style="color: #004651;">y</span> = prog.NewContinuousVariables<span style="color: #1F55A0;">(</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #1F55A0;">)[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #1F55A0;">]</span>;
prog.AddConstraint<span style="color: #1F55A0;">(</span>x + y &gt;= <span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #1F55A0;">)</span>;
prog.AddConstraint<span style="color: #1F55A0;">(</span>x + y &lt;= <span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #1F55A0;">)</span>;
prog.AddCost<span style="color: #1F55A0;">(</span>x<span style="color: #1F55A0;">)</span>;

<span style="color: #D70000;">auto</span> <span style="color: #004651;">result</span> = Solve<span style="color: #1F55A0;">(</span>prog<span style="color: #1F55A0;">)</span>;
print<span style="color: #1F55A0;">(</span><span style="color: #005F00;">"Success? "</span>, result.is_success<span style="color: #AF005F;">()</span><span style="color: #1F55A0;">)</span>;
print<span style="color: #1F55A0;">(</span>result.get_solution_result<span style="color: #AF005F;">()</span><span style="color: #1F55A0;">)</span>;
</pre>
</div>

<p>
To play around with it, <a href="https://github.com/Maverobot/docker-compiler-explorer-drake#usage">launch compiler-explorer locally</a> and click <a href="http://localhost:10240/#g:!((g:!((g:!((h:codeEditor,i:(filename:'1',fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,selection:(endColumn:1,endLineNumber:29,positionColumn:1,positionLineNumber:29,selectionStartColumn:1,selectionStartLineNumber:29,startColumn:1,startLineNumber:29),source:'%23include+%3Cdrake/solvers/mathematical_program.h%3E%0A%23include+%3Cdrake/solvers/solve.h%3E%0A%0A%23include+%3Ciostream%3E%0A%0Atemplate+%3Ctypename...+Args%3E%0Avoid+print(Args%26%26...+value)+%7B%0A++(std::cout+%3C%3C+...+%3C%3C+value)+%3C%3C+%22%5Cn---%5Cn%22%3B%0A%7D%0A%0Aint+main(int+argc,+char*+argv%5B%5D)+%7B%0A++auto+prog+%3D+drake::solvers::MathematicalProgram()%3B%0A++auto+x+%3D+prog.NewContinuousVariables(1)%5B0%5D%3B%0A++print(%22x+%3D+%22,+x)%3B%0A++auto+y+%3D+prog.NewContinuousVariables(1)%5B0%5D%3B%0A++print(%22y+%3D+%22,+y)%3B%0A++auto+constraint1+%3D+prog.AddConstraint(x+%2B+y+%3E%3D+1)%3B%0A++print(%22constraint1:+%22,+constraint1)%3B%0A++auto+constraint2+%3D+prog.AddConstraint(x+%2B+y+%3C%3D+0)%3B%0A++print(%22constraint2:+%22,+constraint2)%3B%0A++auto+cost1+%3D+prog.AddCost(x)%3B%0A++print(%22cost1:+%22,+cost1)%3B%0A%0A++auto+result+%3D+drake::solvers::Solve(prog)%3B%0A++print(%22Success:+%22,+result.is_success())%3B%0A++print(%22Solution+result:+%22,+result.get_solution_result())%3B%0A++return+0%3B%0A%7D%0A'),l:'5',n:'0',o:'C%2B%2B+source+%231',t:'0')),k:54.063974829575244,l:'4',n:'0',o:'',s:0,t:'0'),(g:!((h:compiler,i:(compiler:g9,filters:(b:'0',binary:'1',commentOnly:'0',demangle:'0',directives:'0',execute:'0',intel:'0',libraryCode:'0',trim:'1'),flagsViewOpen:'1',fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,libs:!((name:eigen,ver:'337'),(name:drake,ver:'110')),options:'-std%3Dc%2B%2B17',selection:(endColumn:1,endLineNumber:1,positionColumn:1,positionLineNumber:1,selectionStartColumn:1,selectionStartLineNumber:1,startColumn:1,startLineNumber:1),source:1,tree:'1'),l:'5',n:'0',o:'g%2B%2B+9+(C%2B%2B,+Editor+%231,+Compiler+%231)',t:'0'),(h:output,i:(compiler:1,editor:1,fontScale:14,fontUsePx:'0',tree:'1',wrap:'1'),l:'5',n:'0',o:'Output+of+g%2B%2B+9+(Compiler+%231)',t:'0')),k:45.936025170424756,l:'4',m:100,n:'0',o:'',s:1,t:'0')),l:'2',n:'0',o:'',t:'0')),version:4">here</a>.
</p>
</div>
</div>
