mathematical_program.org
*** Manually choosing a solver

If you want to choose a solver yourself, rather than Drake choosing one for you, you could instantiate a solver explicitly, and call its =Solve=
function. There are two apporaches to instantiate a solver. For example, if I want to solve a problem using the open-source solver [[https://github.com/coin-or/Ipopt][IPOPT]],
I can instantiate the solver using either of the two approaches:
1. The simplest approach is to call
   #+begin_src cpp
     #include <drake/solvers/ipopt_solver.h>
     // ...
     auto solver = drake::solvers::IpoptSolver();
   #+end_src
2. The second approach is to construct a solver with a given solver ID as
   #+begin_src cpp
     #include <drake/solvers/choose_best_solver.h>
     // ...
     auto solver = drake::solvers::MakeSolver(drake::solvers::IpoptSolver::id());
   #+end_src

A complete example:
#+begin_src cpp
  #include <drake/solvers/ipopt_solver.h>
  #include <drake/solvers/mathematical_program.h>

  #include <iostream>

  template <typename... Args>
  void print(Args&&... value) {
    (std::cout << ... << value) << "\n---\n";
  }

  int main(int argc, char* argv[]) {
    /*
     ,* Solves a simple optimization problem
     ,*
     ,* min x(0)
     ,*
     ,* subject to x(0) + x(1) = 1
     ,*            0 <= x(1) <= 1
     ,*/
    // Set up the optimization problem.
    auto prog = drake::solvers::MathematicalProgram();
    auto x = prog.NewContinuousVariables(2);
    print("x = ", x);
    auto constraint1 = prog.AddConstraint(x[0] + x[1] == 1);
    print("constraint1: ", constraint1);
    auto constraint2 = prog.AddConstraint(0 <= x[1]);
    print("constraint2: ", constraint2);
    auto constraint3 = prog.AddConstraint(x[1] <= 1);
    print("constraint3: ", constraint3);
    auto cost1 = prog.AddCost(x[0]);
    print("cost1: ", cost1);

    drake::solvers::IpoptSolver solver;
    // The initial guess is [1, 1]. The third argument is the options for Ipopt solver, and we set no
    // solver options.
    Eigen::VectorXd initial_guess(2);
    initial_guess << 1, 1;
    auto result = solver.Solve(prog, initial_guess, std::nullopt);
    print(result.get_solution_result());
    print("x* = ", result.GetSolution(x));
    print("Solver is ", result.get_solver_id().name());
    print("Ipopt solver status: ", result.get_solver_details<drake::solvers::IpoptSolver>().status,
          ", meaning ",
          result.get_solver_details<drake::solvers::IpoptSolver>().ConvertStatusToString());
    return 0;
    ;
  }
#+end_src

To play around with it, launch compiler-explorer locally and click [[http://localhost:10240/#z:OYLghAFBqd5QCxAYwPYBMCmBRdBLAF1QCcAaPECAMzwBtMA7AQwFtMQByARg9KtQYEAysib0QXACx8BBAKoBnTAAUAHpwAMvAFYTStJg1DIApACYAQuYukl9ZATwDKjdAGFUtAK4sGISVykrgAyeAyYAHI%2BAEaYxP4apAAOqAqETgwe3r7%2BgSlpjgKh4VEssfGSiXaYDhlCBEzEBFk%2BfgG2mPaFDPWNBMWRMXEJtg1NLTntCmP9YYNlw5UAlLaoXsTI7BzmAMxhyN5YANQmO27oxEwA1pgA9AqeAG5xCrd4KUkEAPoPtM/EADoEKdsCYNABBXb7Q6YE5nC7XO6/f6vFhMAgITBoxyiWhfJLEVDAS4sIEgsGQiFQhgHLzHU5uJzTYiYVjkqkQghYpIGLlwtwEACeSUYrEwAIlR3BxGACnZ4MeqDw6COBLCBAg0tl5gAbLqJQCjo8xF5MEsTgB2KwQo5HCDTdAgFBrAj8hlHA1us5Gk1mr1uE5mMwmACsbgYAFoo6Hw%2BZgztrZCLQARCkU9VHNFhCAZxrAZCkI7IBCNABURzzj1DVhDyfNJitFNtt1LTdt5aET0wCgrRzSLB5sNQnzwLDwAC90RlVYTovQWG2jq2be3M2EjqoIBolovl%2BDbUu%2B15otoaq6iBut/XLJeuPWdsmjlxdwfX2%2BNF7H5u75%2Bn7vbm2ty3EcQiYK6XhJEcGJDiOY6Tt0M6oHOWIAm2TBeBeBJEnCj4IjcTrIi8ToALLopi2J4LiyiEsSrAQDuCZoRhqAbjhiHAACESYAA7h4ghhF4awKAAao0eBMMhCgQGYDGJraaqCBAcaqGxcaFqoslMReaAMMyTDqlwbFYRx4LoO4Ah6eqECqNWGiho%2B1gbtWz61jhpyPnepxyTOVlxjplmCFwICBmYhb%2BQQlwGZpK7odpFkRfpghmEZNEAqZ5m6QlVkfgy7lOSGFguXWXltgpGp%2BfFkVJcFalFpViUEDJJUxcxdWZVVBA7ClRJpWZfEBRqNkFUVv6eYxK5lUpQbhR1Ow1UGYX1eqOzRfuFatWg0yGXlxm9eZ0zWbZ9mrfJxC%2BdNqQEEFIWLVtq1tnh7AgIRxAKE6ACSHzCF2xB9j9zVrUBRwACqYkcYTpGIRzAKaCg9ngPbOYWRWGqDsIYngxAqnmPiMK6CNQWDw7dD2/C/Z9xN/X8cSFoYKrcbCSiugwqCAcBL1HMTGQKKhK7YHgwCME6wlniQAAaKoQ44YhfDD3ZSU141rVL4l4nLcP%2Bk%2ByMA7asUsSyCheLQrp5S9AKdtTEDGYWKsy%2BrCiFg6ToMEbtDEydPmKQbRsEACgvfL8GEZF83vG/RHuTcp5Z5bVoe%2BwA4mBFtBwI1lLBHZ2KXGFv/ODiMLUccd%2B2BPw/V8yr0QCzBsOHOue%2BVQYU58VO59M6JeG9N2F92PvFwHZdYA0dByvClz4c9P1vSATffdTxAgpXbcEB3pCLm%2BtVsIYYTADda%2BvkX/ul3PXyD/ptAj%2BcY9PS9U8zzncQL0sAJ8f8wgNMvCjA6g9SZ8AtdK7aFky9iAMCOHZABcJEwNlTBCDgKxaCcBDLwPwHAtCkFQJwNw1hHIPHWJsQMOweCkAIJoOBKwrggBDJIAEGgdQ7AAJwWkkAADjMPQkMFoQxmEkNIBBHBJDINIegzgvA3qJBIaguBpA4CwCQGgAcdAaYUAgPIpIij4jAHoXwOgXJXqUGiEI6IYRGiCk4EQ%2BRbBBAAHkGC0FMZI0gWA0RGHEA4/ALJajPDeg4zAqgagYS2Gg9UnQhG0DwNES4xBBQeCwEIiKo4zFSKoAYWUwk8A8SsSKFBRD%2BCCBEGIdgUgZCCEUCodQDjdCBAMEYFA2DLD6HCW9WA1d2CYAFowUg/xOA7B2BaKREAWkgEep04Y3AuBaHTugkcFlOARgdO5UwlhrBcD6R0LoGQXAMHMtkPwgQQhzFKOUPQ%2BR0gCAmLs5IqRTkMAGIc4YgRqi1AEL0cYnhWh6Eed0F5swShDHiA8mY5yPkzFuX8iQKxcEbEKcQlkWweDwMQYIhxGCODADqRYI49C7RYKWfUo4uBCAkAIYEI4HgFH0F%2BrsO8vAJETOkUgF0SQMLkEoKo9RehMD4CIP84pwhcSFOkLk%2BQSg1BxNhYk0g3FLhJESQijgSDSAoLQSiqxGEmWulQFQaG6LMXYtQOSuIxKlg0tIZMihkgQwAnoTsHUGgzAhhWRoSQ3DOE6n0JwARpAWASA0IkJVvAUWiL0LSsh7qOBmCRcqkRxDTUrBRBsyQQA][here]].

Note that =solver.Solve()= expects three input arguments, the optimization program =prog=, the initial guess of the decision variable
values (=[1, 1]= in this case), and an optional setting for the solver (=None= in this case, we use the default IPOPT setting). If you don't
have an initial guess, you could call =solver.Solve(prog)=. Drake will choose a default initial guess (a 0-valued vector), but this initial
guess might be a bad starting point for optimization. Note from the following example code, with the default initial guess, the solver
cannot find a solution, even though a solution exists (and could be found with initial guess [1, 1]).

#+begin_src cpp
  auto result = solver.Solve(prog);
  print(result.get_solution_result());
  print("x* = ", result.GetSolution(x));
  /*
   ,* Output:
   ,* SolutionFound
   ,* ---
   ,* x* = -9.99e-09
   ,*         1
   ,*/
#+end_src

Also note that if we know which solver is called, then we can access some solver-specific result, by calling =result.get_solver_details()=.
For example, =IpoptSolverDetails= contains a field =status=, namely the status code of the IPOPT solver, we could access this info by

#+begin_src cpp
  print("Ipopt solver status: ", result.get_solver_details<drake::solvers::IpoptSolver>().status,
        ", meaning ",
        result.get_solver_details<drake::solvers::IpoptSolver>().ConvertStatusToString());
#+end_src

Each solver has its own details. You should refer to =FooSolverDetails= class on what is stored inside the return argument of
=result.get_solver_details()=. For example, if you know that IPOPT is called, then refer to =IpoptSolverDetails= class; for OSQP solver, refer
to =OsqpSolverDetails=, etc.

