mathematical_program.html

<div id="outline-container-org54ab120" class="outline-4">
<h4 id="org54ab120">Manually choosing a solver</h4>
<div class="outline-text-4" id="text-org54ab120">
<p>
If you want to choose a solver yourself, rather than Drake choosing one for you, you could instantiate a solver explicitly, and call its <code>Solve</code>
function. There are two apporaches to instantiate a solver. For example, if I want to solve a problem using the open-source solver <a href="https://github.com/coin-or/Ipopt">IPOPT</a>,
I can instantiate the solver using either of the two approaches:
</p>
<ol class="org-ol">
<li><p>
The simplest approach is to call
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">drake/solvers/ipopt_solver.h</span><span style="color: #1F55A0;">&gt;</span>
<span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">...</span>
<span style="color: #D70000;">auto</span> <span style="color: #004651;">solver</span> = <span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::IpoptSolver<span style="color: #1F55A0;">()</span>;
</pre>
</div></li>
<li><p>
The second approach is to construct a solver with a given solver ID as
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">drake/solvers/choose_best_solver.h</span><span style="color: #1F55A0;">&gt;</span>
<span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">...</span>
<span style="color: #D70000;">auto</span> <span style="color: #004651;">solver</span> = <span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::MakeSolver<span style="color: #1F55A0;">(</span><span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::<span style="color: #AF005F;">IpoptSolver</span>::id<span style="color: #AF005F;">()</span><span style="color: #1F55A0;">)</span>;
</pre>
</div></li>
</ol>

<p>
A complete example:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">drake/solvers/ipopt_solver.h</span><span style="color: #1F55A0;">&gt;</span>
<span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">drake/solvers/mathematical_program.h</span><span style="color: #1F55A0;">&gt;</span>

<span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">iostream</span><span style="color: #1F55A0;">&gt;</span>

<span style="color: #D70000;">template</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #D70000;">typename</span>... <span style="color: #1F55A0;">Args</span><span style="color: #1F55A0;">&gt;</span>
<span style="color: #1F55A0;">void</span> <span style="color: #AF8700;">print</span><span style="color: #1F55A0;">(</span><span style="color: #1F55A0;">Args</span>&amp;&amp;... <span style="color: #004651;">value</span><span style="color: #1F55A0;">)</span> <span style="color: #1F55A0;">{</span>
  <span style="color: #AF005F;">(</span><span style="color: #AF005F;">std</span>::cout &lt;&lt; ... &lt;&lt; value<span style="color: #AF005F;">)</span> &lt;&lt; <span style="color: #005F00;">"\n---\n"</span>;
<span style="color: #1F55A0;">}</span>

<span style="color: #1F55A0;">int</span> <span style="color: #AF8700;">main</span><span style="color: #1F55A0;">(</span><span style="color: #1F55A0;">int</span> <span style="color: #004651;">argc</span>, <span style="color: #1F55A0;">char</span>* <span style="color: #004651;">argv</span><span style="color: #AF005F;">[]</span><span style="color: #1F55A0;">)</span> <span style="color: #1F55A0;">{</span>
  <span style="color: #4E4E4E; font-style: italic;">/*</span>
<span style="color: #4E4E4E; font-style: italic;">   * Solves a simple optimization problem</span>
<span style="color: #4E4E4E; font-style: italic;">   *</span>
<span style="color: #4E4E4E; font-style: italic;">   * min x(0)</span>
<span style="color: #4E4E4E; font-style: italic;">   *</span>
<span style="color: #4E4E4E; font-style: italic;">   * subject to x(0) + x(1) = 1</span>
<span style="color: #4E4E4E; font-style: italic;">   *            0 &lt;= x(1) &lt;= 1</span>
<span style="color: #4E4E4E; font-style: italic;">   */</span>
  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">Set up the optimization problem.</span>
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">prog</span> = <span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::MathematicalProgram<span style="color: #AF005F;">()</span>;
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">x</span> = prog.NewContinuousVariables<span style="color: #AF005F;">(</span><span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"x = "</span>, x<span style="color: #AF005F;">)</span>;
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">constraint1</span> = prog.AddConstraint<span style="color: #AF005F;">(</span>x<span style="color: #005F00;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #005F00;">]</span> + x<span style="color: #005F00;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #005F00;">]</span> == <span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"constraint1: "</span>, constraint1<span style="color: #AF005F;">)</span>;
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">constraint2</span> = prog.AddConstraint<span style="color: #AF005F;">(</span><span style="color: #D75F00; font-weight: bold;">0</span> &lt;= x<span style="color: #005F00;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #005F00;">]</span><span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"constraint2: "</span>, constraint2<span style="color: #AF005F;">)</span>;
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">constraint3</span> = prog.AddConstraint<span style="color: #AF005F;">(</span>x<span style="color: #005F00;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #005F00;">]</span> &lt;= <span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"constraint3: "</span>, constraint3<span style="color: #AF005F;">)</span>;
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">cost1</span> = prog.AddCost<span style="color: #AF005F;">(</span>x<span style="color: #005F00;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #005F00;">]</span><span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"cost1: "</span>, cost1<span style="color: #AF005F;">)</span>;

  <span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::<span style="color: #1F55A0;">IpoptSolver</span> <span style="color: #004651;">solver</span>;
  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">The initial guess is [1, 1]. The third argument is the options for Ipopt solver, and we set no</span>
  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">solver options.</span>
  <span style="color: #AF005F;">Eigen</span>::<span style="color: #1F55A0;">VectorXd</span> <span style="color: #004651;">initial_guess</span><span style="color: #AF005F;">(</span><span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #AF005F;">)</span>;
  initial_guess &lt;&lt; <span style="color: #D75F00; font-weight: bold;">1</span>, <span style="color: #D75F00; font-weight: bold;">1</span>;
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">result</span> = solver.Solve<span style="color: #AF005F;">(</span>prog, initial_guess, <span style="color: #AF005F;">std</span>::nullopt<span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span>result.get_solution_result<span style="color: #005F00;">()</span><span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"x* = "</span>, result.GetSolution<span style="color: #005F00;">(</span>x<span style="color: #005F00;">)</span><span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"Solver is "</span>, result.get_solver_id<span style="color: #005F00;">()</span>.name<span style="color: #005F00;">()</span><span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"Ipopt solver status: "</span>, result.get_solver_details<span style="color: #005F00;">&lt;</span><span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::<span style="color: #1F55A0;">IpoptSolver</span><span style="color: #005F00;">&gt;()</span>.status,
        <span style="color: #005F00;">", meaning "</span>,
        result.get_solver_details<span style="color: #005F00;">&lt;</span><span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::<span style="color: #1F55A0;">IpoptSolver</span><span style="color: #005F00;">&gt;()</span>.ConvertStatusToString<span style="color: #005F00;">()</span><span style="color: #AF005F;">)</span>;
  <span style="color: #D70000;">return</span> <span style="color: #D75F00; font-weight: bold;">0</span>;
  ;
<span style="color: #1F55A0;">}</span>
</pre>
</div>

<p>
To play around with it, <a href="https://github.com/Maverobot/docker-compiler-explorer-drake#usage">launch compiler-explorer locally</a> and click <a href="http://localhost:10240/#z:OYLghAFBqd5QCxAYwPYBMCmBRdBLAF1QCcAaPECAMzwBtMA7AQwFtMQByARg9KtQYEAysib0QXACx8BBAKoBnTAAUAHpwAMvAFYTStJg1DIApACYAQuYukl9ZATwDKjdAGFUtAK4sGISVykrgAyeAyYAHI%2BAEaYxP4apAAOqAqETgwe3r7%2BgSlpjgKh4VEssfGSiXaYDhlCBEzEBFk%2BfgG2mPaFDPWNBMWRMXEJtg1NLTntCmP9YYNlw5UAlLaoXsTI7BzmAMxhyN5YANQmO27oxEwA1pgA9AqeAG5xCrd4KUkEAPoPtM/EADoEKdsCYNABBXb7Q6YE5nC7XO6/f6vFhMAgITBoxyiWhfJLEVDAS4sIEgsGQiFQhgHLzHU5uJzTYiYVjkqkQghYpIGLlwtwEACeSUYrEwAIlR3BxGACnZ4MeqDw6COBLCBAg0tl5gAbLqJQCjo8xF5MEsTgB2KwQo5HCDTdAgFBrAj8hlHA1us5Gk1mr1uE5mMwmACsbgYAFoo6Hw%2BZgztrZCLQARCkU9VHNFhCAZxrAZCkI7IBCNABURzzj1DVhDyfNJitFNtt1LTdt5aET0wCgrRzSLB5sNQnzwLDwAC90RlVYTovQWG2jq2be3M2EjqoIBolovl%2BDbUu%2B15otoaq6iBut/XLJeuPWdsmjlxdwfX2%2BNF7H5u75%2Bn7vbm2ty3EcQiYK6XhJEcGJDiOY6Tt0M6oHOWIAm2TBeBeBJEnCj4IjcTrIi8ToALLopi2J4LiyiEsSrAQDuCZoRhqAbjhiHAACESYAA7h4ghhF4awKAAao0eBMMhCgQGYDGJraaqCBAcaqGxcaFqoslMReaAMMyTDqlwbFYRx4LoO4Ah6eqECqNWGiho%2B1gbtWz61jhpyPnepxyTOVlxjplmCFwICBmYhb%2BQQlwGZpK7odpFkRfpghmEZNEAqZ5m6QlVkfgy7lOSGFguXWXltgpGp%2BfFkVJcFalFpViUEDJJUxcxdWZVVBA7ClRJpWZfEBRqNkFUVv6eYxK5lUpQbhR1Ow1UGYX1eqOzRfuFatWg0yGXlxm9eZ0zWbZ9mrfJxC%2BdNqQEEFIWLVtq1tnh7AgIRxAKE6ACSHzCF2xB9j9zVrUBRwACqYkcYTpGIRzAKaCg9ngPbOYWRWGqDsIYngxAqnmPiMK6CNQWDw7dD2/C/Z9xN/X8cSFoYKrcbCSiugwqCAcBL1HMTGQKKhK7YHgwCME6wlniQAAaKoQ44YhfDD3ZSU141rVL4l4nLcP%2Bk%2ByMA7asUsSyCheLQrp5S9AKdtTEDGYWKsy%2BrCiFg6ToMEbtDEydPmKQbRsEACgvfL8GEZF83vG/RHuTcp5Z5bVoe%2BwA4mBFtBwI1lLBHZ2KXGFv/ODiMLUccd%2B2BPw/V8yr0QCzBsOHOue%2BVQYU58VO59M6JeG9N2F92PvFwHZdYA0dByvClz4c9P1vSATffdTxAgpXbcEB3pCLm%2BtVsIYYTADda%2BvkX/ul3PXyD/ptAj%2BcY9PS9U8zzncQL0sAJ8f8wgNMvCjA6g9SZ8AtdK7aFky9iAMCOHZABcJEwNlTBCDgKxaCcBDLwPwHAtCkFQJwNw1hHIPHWJsQMOweCkAIJoOBKwrggBDJIAEGgdQ7AAJwWkkAADjMPQkMFoQxmEkNIBBHBJDINIegzgvA3qJBIaguBpA4CwCQGgAcdAaYUAgPIpIij4jAHoXwOgXJXqUGiEI6IYRGiCk4EQ%2BRbBBAAHkGC0FMZI0gWA0RGHEA4/ALJajPDeg4zAqgagYS2Gg9UnQhG0DwNES4xBBQeCwEIiKo4zFSKoAYWUwk8A8SsSKFBRD%2BCCBEGIdgUgZCCEUCodQDjdCBAMEYFA2DLD6HCW9WA1d2CYAFowUg/xOA7B2BaKREAWkgEep04Y3AuBaHTugkcFlOARgdO5UwlhrBcD6R0LoGQXAMHMtkPwgQQhzFKOUPQ%2BR0gCAmLs5IqRTkMAGIc4YgRqi1AEL0cYnhWh6Eed0F5swShDHiA8mY5yPkzFuX8iQKxcEbEKcQlkWweDwMQYIhxGCODADqRYI49C7RYKWfUo4uBCAkAIYEI4HgFH0F%2BrsO8vAJETOkUgF0SQMLkEoKo9RehMD4CIP84pwhcSFOkLk%2BQSg1BxNhYk0g3FLhJESQijgSDSAoLQSiqxGEmWulQFQaG6LMXYtQOSuIxKlg0tIZMihkgQwAnoTsHUGgzAhhWRoSQ3DOE6n0JwARpAWASA0IkJVvAUWiL0LSsh7qOBmCRcqkRxDTUrBRBsyQQA">here</a>.
</p>

<p>
Note that <code>solver.Solve()</code> expects three input arguments, the optimization program <code>prog</code>, the initial guess of the decision variable
values (<code>[1, 1]</code> in this case), and an optional setting for the solver (<code>None</code> in this case, we use the default IPOPT setting). If you don't
have an initial guess, you could call <code>solver.Solve(prog)</code>. Drake will choose a default initial guess (a 0-valued vector), but this initial
guess might be a bad starting point for optimization. Note from the following example code, with the default initial guess, the solver
cannot find a solution, even though a solution exists (and could be found with initial guess [1, 1]).
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #D70000;">auto</span> <span style="color: #004651;">result</span> = solver.Solve<span style="color: #1F55A0;">(</span>prog<span style="color: #1F55A0;">)</span>;
print<span style="color: #1F55A0;">(</span>result.get_solution_result<span style="color: #AF005F;">()</span><span style="color: #1F55A0;">)</span>;
print<span style="color: #1F55A0;">(</span><span style="color: #005F00;">"x* = "</span>, result.GetSolution<span style="color: #AF005F;">(</span>x<span style="color: #AF005F;">)</span><span style="color: #1F55A0;">)</span>;
<span style="color: #4E4E4E; font-style: italic;">/*</span>
<span style="color: #4E4E4E; font-style: italic;"> * Output:</span>
<span style="color: #4E4E4E; font-style: italic;"> * SolutionFound</span>
<span style="color: #4E4E4E; font-style: italic;"> * ---</span>
<span style="color: #4E4E4E; font-style: italic;"> * x* = -9.99e-09</span>
<span style="color: #4E4E4E; font-style: italic;"> *         1</span>
<span style="color: #4E4E4E; font-style: italic;"> */</span>
</pre>
</div>

<p>
Also note that if we know which solver is called, then we can access some solver-specific result, by calling <code>result.get_solver_details()</code>.
For example, <code>IpoptSolverDetails</code> contains a field <code>status</code>, namely the status code of the IPOPT solver, we could access this info by
</p>

<div class="org-src-container">
<pre class="src src-cpp">print<span style="color: #1F55A0;">(</span><span style="color: #005F00;">"Ipopt solver status: "</span>, result.get_solver_details<span style="color: #AF005F;">&lt;</span><span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::IpoptSolver<span style="color: #AF005F;">&gt;()</span>.status,
      <span style="color: #005F00;">", meaning "</span>,
      result.get_solver_details<span style="color: #AF005F;">&lt;</span><span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::IpoptSolver<span style="color: #AF005F;">&gt;()</span>.ConvertStatusToString<span style="color: #AF005F;">()</span><span style="color: #1F55A0;">)</span>;
</pre>
</div>

<p>
Each solver has its own details. You should refer to <code>FooSolverDetails</code> class on what is stored inside the return argument of
<code>result.get_solver_details()</code>. For example, if you know that IPOPT is called, then refer to <code>IpoptSolverDetails</code> class; for OSQP solver, refer
to <code>OsqpSolverDetails</code>, etc.
</p>
</div>
</div>
</div>
