mathematical_program.html

<div id="outline-container-org3f36e72" class="outline-3">
<h3 id="org3f36e72">Using an initial guess</h3>
<div class="outline-text-3" id="text-org3f36e72">
<p>
Some optimization problems, such as nonlinear optimization, require an initial guess. Other types of problems, such as quadratic programming,
mixed-integer optimization, etc, can be solved faster if a good initial guess is provided. The user could provide an initial guess as an input
argument in <code>Solve</code> function. If no initial guess is provided, Drake will use a zero-valued vector as the initial guess.
</p>

<p>
In the example below, we show that an initial guess could affect the result of the problem. Without an user-provided initial guess, the
solver might be unable to find the solution.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">drake/solvers/ipopt_solver.h</span><span style="color: #1F55A0;">&gt;</span>
<span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">drake/solvers/mathematical_program.h</span><span style="color: #1F55A0;">&gt;</span>

<span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">iostream</span><span style="color: #1F55A0;">&gt;</span>

<span style="color: #D70000;">template</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #D70000;">typename</span>... <span style="color: #1F55A0;">Args</span><span style="color: #1F55A0;">&gt;</span>
<span style="color: #1F55A0;">void</span> <span style="color: #AF8700;">print</span><span style="color: #1F55A0;">(</span><span style="color: #1F55A0;">Args</span>&amp;&amp;... <span style="color: #004651;">value</span><span style="color: #1F55A0;">)</span> <span style="color: #1F55A0;">{</span>
  <span style="color: #AF005F;">(</span><span style="color: #AF005F;">std</span>::cout &lt;&lt; ... &lt;&lt; value<span style="color: #AF005F;">)</span> &lt;&lt; <span style="color: #005F00;">"\n---\n"</span>;
<span style="color: #1F55A0;">}</span>

<span style="color: #1F55A0;">int</span> <span style="color: #AF8700;">main</span><span style="color: #1F55A0;">(</span><span style="color: #1F55A0;">int</span> <span style="color: #004651;">argc</span>, <span style="color: #1F55A0;">char</span>* <span style="color: #004651;">argv</span><span style="color: #AF005F;">[]</span><span style="color: #1F55A0;">)</span> <span style="color: #1F55A0;">{</span>
  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">Set up the optimization problem.</span>
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">prog</span> = <span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::MathematicalProgram<span style="color: #AF005F;">()</span>;
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">x</span> = prog.NewContinuousVariables<span style="color: #AF005F;">(</span><span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #AF005F;">)</span>;
  prog.AddConstraint<span style="color: #AF005F;">(</span>pow<span style="color: #005F00;">(</span>x<span style="color: #8700AF;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #8700AF;">]</span>, <span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #005F00;">)</span> + pow<span style="color: #005F00;">(</span>x<span style="color: #8700AF;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #8700AF;">]</span>, <span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #005F00;">)</span> == <span style="color: #D75F00; font-weight: bold;">100</span>.<span style="color: #AF005F;">)</span>;
  prog.AddCost<span style="color: #AF005F;">(</span>pow<span style="color: #005F00;">(</span>x<span style="color: #8700AF;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #8700AF;">]</span>, <span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #005F00;">)</span> - pow<span style="color: #005F00;">(</span>x<span style="color: #8700AF;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #8700AF;">]</span>, <span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #005F00;">)</span><span style="color: #AF005F;">)</span>;
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">solver</span> = <span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::IpoptSolver<span style="color: #AF005F;">()</span>;
  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">The user doesn't provide an initial guess.</span>
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">result</span> = solver.Solve<span style="color: #AF005F;">(</span>prog, <span style="color: #AF005F;">std</span>::nullopt, <span style="color: #AF005F;">std</span>::nullopt<span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"Without a good initial guess, success? "</span>, result.is_success<span style="color: #005F00;">()</span><span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"Solution:"</span>, result.GetSolution<span style="color: #005F00;">(</span>x<span style="color: #005F00;">)</span><span style="color: #AF005F;">)</span>;
  <span style="color: #4E4E4E; font-style: italic;">// </span><span style="color: #4E4E4E; font-style: italic;">Pass an initial guess</span>
  <span style="color: #AF005F;">Eigen</span>::<span style="color: #1F55A0;">VectorXd</span> <span style="color: #004651;">initial_guess</span><span style="color: #AF005F;">(</span><span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #AF005F;">)</span>;
  initial_guess &lt;&lt; -<span style="color: #D75F00; font-weight: bold;">5</span>, <span style="color: #D75F00; font-weight: bold;">0</span>;
  result = solver.Solve<span style="color: #AF005F;">(</span>prog, initial_guess, <span style="color: #AF005F;">std</span>::nullopt<span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"With a good initial guess, success? "</span>, result.is_success<span style="color: #005F00;">()</span><span style="color: #AF005F;">)</span>;
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"Solution:"</span>, result.GetSolution<span style="color: #005F00;">(</span>x<span style="color: #005F00;">)</span><span style="color: #AF005F;">)</span>;
  <span style="color: #D70000;">return</span> <span style="color: #D75F00; font-weight: bold;">0</span>;
  ;
<span style="color: #1F55A0;">}</span>
</pre>
</div>

<p>
To play around with it, <a href="https://github.com/Maverobot/docker-compiler-explorer-drake#usage">launch compiler-explorer locally</a> and click <a href="http://localhost:10240/#g:!((g:!((g:!((h:codeEditor,i:(filename:'1',fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,selection:(endColumn:1,endLineNumber:31,positionColumn:1,positionLineNumber:31,selectionStartColumn:1,selectionStartLineNumber:31,startColumn:1,startLineNumber:31),source:'%23include+%3Cdrake/solvers/ipopt_solver.h%3E%0A%23include+%3Cdrake/solvers/mathematical_program.h%3E%0A%0A%23include+%3Ciostream%3E%0A%0Atemplate+%3Ctypename...+Args%3E%0Avoid+print(Args%26%26...+value)+%7B%0A++(std::cout+%3C%3C+...+%3C%3C+value)+%3C%3C+%22%5Cn---%5Cn%22%3B%0A%7D%0A%0Aint+main(int+argc,+char*+argv%5B%5D)+%7B%0A++//+Set+up+the+optimization+problem.%0A++auto+prog+%3D+drake::solvers::MathematicalProgram()%3B%0A++auto+x+%3D+prog.NewContinuousVariables(2)%3B%0A++prog.AddConstraint(pow(x%5B0%5D,+2)+%2B+pow(x%5B1%5D,+2)+%3D%3D+100.)%3B%0A++prog.AddCost(pow(x%5B0%5D,+2)+-+pow(x%5B1%5D,+2))%3B%0A++auto+solver+%3D+drake::solvers::IpoptSolver()%3B%0A++//+The+user+doesn!'t+provide+an+initial+guess.%0A++auto+result+%3D+solver.Solve(prog,+std::nullopt,+std::nullopt)%3B%0A++print(%22Without+a+good+initial+guess,+success%3F+%22,+result.is_success())%3B%0A++print(%22Solution:%22,+result.GetSolution(x))%3B%0A++//+Pass+an+initial+guess%0A++Eigen::VectorXd+initial_guess(2)%3B%0A++initial_guess+%3C%3C+-5,+0%3B%0A++result+%3D+solver.Solve(prog,+initial_guess,+std::nullopt)%3B%0A++print(%22With+a+good+initial+guess,+success%3F+%22,+result.is_success())%3B%0A++print(%22Solution:%22,+result.GetSolution(x))%3B%0A++return+0%3B%0A++%3B%0A%7D%0A'),l:'5',n:'0',o:'C%2B%2B+source+%231',t:'0')),k:54.063974829575244,l:'4',n:'0',o:'',s:0,t:'0'),(g:!((h:compiler,i:(compiler:g9,filters:(b:'0',binary:'1',commentOnly:'0',demangle:'0',directives:'0',execute:'0',intel:'0',libraryCode:'0',trim:'1'),flagsViewOpen:'1',fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,libs:!((name:eigen,ver:'337'),(name:drake,ver:'110')),options:'-std%3Dc%2B%2B17',selection:(endColumn:1,endLineNumber:1,positionColumn:1,positionLineNumber:1,selectionStartColumn:1,selectionStartLineNumber:1,startColumn:1,startLineNumber:1),source:1,tree:'1'),l:'5',n:'0',o:'g%2B%2B+9+(C%2B%2B,+Editor+%231,+Compiler+%231)',t:'0'),(h:output,i:(compiler:1,editor:1,fontScale:14,fontUsePx:'0',tree:'1',wrap:'1'),l:'5',n:'0',o:'Output+of+g%2B%2B+9+(Compiler+%231)',t:'0')),k:45.936025170424756,l:'4',m:100,n:'0',o:'',s:1,t:'0')),l:'2',n:'0',o:'',t:'0')),version:4">here</a>.
</p>

<p>
For more details on setting the initial guess, the user could refer to <a href="./nonlinear_program.ipynb">Nonlinear program</a> section <code>Setting the initial guess</code>.
</p>
</div>
</div>
</div>
