mathematical_program.org
* Add callback

Some solvers support adding a callback function in each iteration. One usage of the callback is to visualize the solver progress in the current
iteration. =MathematicalProgram= supports this usage through the function =AddVisualizationCallback=, although the usage is not limited
to just visualization, the callback function can do anything. Here is an example

#+begin_src cpp
  #include <drake/solvers/mathematical_program.h>
  #include <drake/solvers/solve.h>

  #include <iostream>

  template <typename... Args>
  void print(Args&&... value) {
    (std::cout << ... << value) << "\n---\n";
  }

  void update(const Eigen::Ref<const Eigen::VectorXd>& x) {
    print("x = ", x.transpose());
  }

  int main(int argc, char* argv[]) {
    auto prog = drake::solvers::MathematicalProgram();
    auto x = prog.NewContinuousVariables(2);
    prog.AddConstraint(x[0] * x[1] == 9);
    prog.AddCost(pow(x[0], 2) + pow(x[1], 2));
    prog.AddVisualizationCallback(update, x);

    Eigen::VectorXd x_init(2);
    x_init << 4, 5;
    drake::solvers::Solve(prog, x_init);
    return 0;
  }
#+end_src

To play around with it, launch compiler-explorer locally and click [[http://localhost:10240/#g:!((g:!((g:!((h:codeEditor,i:(filename:'1',fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,selection:(endColumn:1,endLineNumber:27,positionColumn:1,positionLineNumber:27,selectionStartColumn:1,selectionStartLineNumber:27,startColumn:1,startLineNumber:27),source:'++%23include+%3Cdrake/solvers/mathematical_program.h%3E%0A++%23include+%3Cdrake/solvers/solve.h%3E%0A%0A++%23include+%3Ciostream%3E%0A%0A++template+%3Ctypename...+Args%3E%0A++void+print(Args%26%26...+value)+%7B%0A++++(std::cout+%3C%3C+...+%3C%3C+value)+%3C%3C+%22%5Cn---%5Cn%22%3B%0A++%7D%0A%0A++void+update(const+Eigen::Ref%3Cconst+Eigen::VectorXd%3E%26+x)+%7B%0A++++print(%22x+%3D+%22,+x.transpose())%3B%0A++%7D%0A%0A++int+main(int+argc,+char*+argv%5B%5D)+%7B%0A++++auto+prog+%3D+drake::solvers::MathematicalProgram()%3B%0A++++auto+x+%3D+prog.NewContinuousVariables(2)%3B%0A++++prog.AddConstraint(x%5B0%5D+*+x%5B1%5D+%3D%3D+9)%3B%0A++++prog.AddCost(pow(x%5B0%5D,+2)+%2B+pow(x%5B1%5D,+2))%3B%0A++++prog.AddVisualizationCallback(update,+x)%3B%0A%0A++++Eigen::VectorXd+x_init(2)%3B%0A++++x_init+%3C%3C+4,+5%3B%0A++++drake::solvers::Solve(prog,+x_init)%3B%0A++++return+0%3B%0A++%7D%0A'),l:'5',n:'0',o:'C%2B%2B+source+%231',t:'0')),k:54.063974829575244,l:'4',n:'0',o:'',s:0,t:'0'),(g:!((h:compiler,i:(compiler:g9,filters:(b:'0',binary:'1',commentOnly:'0',demangle:'0',directives:'0',execute:'0',intel:'0',libraryCode:'0',trim:'1'),flagsViewOpen:'1',fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,libs:!((name:eigen,ver:'337'),(name:drake,ver:'110')),options:'-std%3Dc%2B%2B17',selection:(endColumn:1,endLineNumber:1,positionColumn:1,positionLineNumber:1,selectionStartColumn:1,selectionStartLineNumber:1,startColumn:1,startLineNumber:1),source:1,tree:'1'),l:'5',n:'0',o:'g%2B%2B+9+(C%2B%2B,+Editor+%231,+Compiler+%231)',t:'0'),(h:output,i:(compiler:1,editor:1,fontScale:14,fontUsePx:'0',tree:'1',wrap:'1'),l:'5',n:'0',o:'Output+of+g%2B%2B+9+(Compiler+%231)',t:'0')),k:45.936025170424756,l:'4',m:100,n:'0',o:'',s:1,t:'0')),l:'2',n:'0',o:'',t:'0')),version:4][here]].

* Advanced tutorials

Setting solver parameters

Updating costs and constraints(e.g. for efficient solving of many similar programs)

Debugging tips

Linear program

Quadratic program

Nonlinear program

Sum-of-squares optimization
