mathematical_program.html

<div id="outline-container-org77d8b8a" class="outline-2">
<h2 id="org77d8b8a">Add callback</h2>
<div class="outline-text-2" id="text-org77d8b8a">
<p>
Some solvers support adding a callback function in each iteration. One usage of the callback is to visualize the solver progress in the current
iteration. <code>MathematicalProgram</code> supports this usage through the function <code>AddVisualizationCallback</code>, although the usage is not limited
to just visualization, the callback function can do anything. Here is an example
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">drake/solvers/mathematical_program.h</span><span style="color: #1F55A0;">&gt;</span>
<span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">drake/solvers/solve.h</span><span style="color: #1F55A0;">&gt;</span>

<span style="color: #1F55A0; font-weight: bold;">#include</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #005F00;">iostream</span><span style="color: #1F55A0;">&gt;</span>

<span style="color: #D70000;">template</span> <span style="color: #1F55A0;">&lt;</span><span style="color: #D70000;">typename</span>... <span style="color: #1F55A0;">Args</span><span style="color: #1F55A0;">&gt;</span>
<span style="color: #1F55A0;">void</span> <span style="color: #AF8700;">print</span><span style="color: #1F55A0;">(</span><span style="color: #1F55A0;">Args</span>&amp;&amp;... <span style="color: #004651;">value</span><span style="color: #1F55A0;">)</span> <span style="color: #1F55A0;">{</span>
  <span style="color: #AF005F;">(</span><span style="color: #AF005F;">std</span>::cout &lt;&lt; ... &lt;&lt; value<span style="color: #AF005F;">)</span> &lt;&lt; <span style="color: #005F00;">"\n---\n"</span>;
<span style="color: #1F55A0;">}</span>

<span style="color: #1F55A0;">void</span> <span style="color: #AF8700;">update</span><span style="color: #1F55A0;">(</span><span style="color: #D70000;">const</span> <span style="color: #AF005F;">Eigen</span>::<span style="color: #1F55A0;">Ref</span><span style="color: #AF005F;">&lt;</span><span style="color: #D70000;">const</span> <span style="color: #AF005F;">Eigen</span>::<span style="color: #1F55A0;">VectorXd</span><span style="color: #AF005F;">&gt;</span>&amp; <span style="color: #004651;">x</span><span style="color: #1F55A0;">)</span> <span style="color: #1F55A0;">{</span>
  print<span style="color: #AF005F;">(</span><span style="color: #005F00;">"x = "</span>, x.transpose<span style="color: #005F00;">()</span><span style="color: #AF005F;">)</span>;
<span style="color: #1F55A0;">}</span>

<span style="color: #1F55A0;">int</span> <span style="color: #AF8700;">main</span><span style="color: #1F55A0;">(</span><span style="color: #1F55A0;">int</span> <span style="color: #004651;">argc</span>, <span style="color: #1F55A0;">char</span>* <span style="color: #004651;">argv</span><span style="color: #AF005F;">[]</span><span style="color: #1F55A0;">)</span> <span style="color: #1F55A0;">{</span>
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">prog</span> = <span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::MathematicalProgram<span style="color: #AF005F;">()</span>;
  <span style="color: #D70000;">auto</span> <span style="color: #004651;">x</span> = prog.NewContinuousVariables<span style="color: #AF005F;">(</span><span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #AF005F;">)</span>;
  prog.AddConstraint<span style="color: #AF005F;">(</span>x<span style="color: #005F00;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #005F00;">]</span> * x<span style="color: #005F00;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #005F00;">]</span> == <span style="color: #D75F00; font-weight: bold;">9</span><span style="color: #AF005F;">)</span>;
  prog.AddCost<span style="color: #AF005F;">(</span>pow<span style="color: #005F00;">(</span>x<span style="color: #8700AF;">[</span><span style="color: #D75F00; font-weight: bold;">0</span><span style="color: #8700AF;">]</span>, <span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #005F00;">)</span> + pow<span style="color: #005F00;">(</span>x<span style="color: #8700AF;">[</span><span style="color: #D75F00; font-weight: bold;">1</span><span style="color: #8700AF;">]</span>, <span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #005F00;">)</span><span style="color: #AF005F;">)</span>;
  prog.AddVisualizationCallback<span style="color: #AF005F;">(</span>update, x<span style="color: #AF005F;">)</span>;

  <span style="color: #AF005F;">Eigen</span>::<span style="color: #1F55A0;">VectorXd</span> <span style="color: #004651;">x_init</span><span style="color: #AF005F;">(</span><span style="color: #D75F00; font-weight: bold;">2</span><span style="color: #AF005F;">)</span>;
  x_init &lt;&lt; <span style="color: #D75F00; font-weight: bold;">4</span>, <span style="color: #D75F00; font-weight: bold;">5</span>;
  <span style="color: #AF005F;">drake</span>::<span style="color: #AF005F;">solvers</span>::Solve<span style="color: #AF005F;">(</span>prog, x_init<span style="color: #AF005F;">)</span>;
  <span style="color: #D70000;">return</span> <span style="color: #D75F00; font-weight: bold;">0</span>;
<span style="color: #1F55A0;">}</span>
</pre>
</div>

<p>
To play around with it, <a href="https://github.com/Maverobot/docker-compiler-explorer-drake#usage">launch compiler-explorer locally</a> and click <a href="http://localhost:10240/#g:!((g:!((g:!((h:codeEditor,i:(filename:'1',fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,selection:(endColumn:1,endLineNumber:27,positionColumn:1,positionLineNumber:27,selectionStartColumn:1,selectionStartLineNumber:27,startColumn:1,startLineNumber:27),source:'++%23include+%3Cdrake/solvers/mathematical_program.h%3E%0A++%23include+%3Cdrake/solvers/solve.h%3E%0A%0A++%23include+%3Ciostream%3E%0A%0A++template+%3Ctypename...+Args%3E%0A++void+print(Args%26%26...+value)+%7B%0A++++(std::cout+%3C%3C+...+%3C%3C+value)+%3C%3C+%22%5Cn---%5Cn%22%3B%0A++%7D%0A%0A++void+update(const+Eigen::Ref%3Cconst+Eigen::VectorXd%3E%26+x)+%7B%0A++++print(%22x+%3D+%22,+x.transpose())%3B%0A++%7D%0A%0A++int+main(int+argc,+char*+argv%5B%5D)+%7B%0A++++auto+prog+%3D+drake::solvers::MathematicalProgram()%3B%0A++++auto+x+%3D+prog.NewContinuousVariables(2)%3B%0A++++prog.AddConstraint(x%5B0%5D+*+x%5B1%5D+%3D%3D+9)%3B%0A++++prog.AddCost(pow(x%5B0%5D,+2)+%2B+pow(x%5B1%5D,+2))%3B%0A++++prog.AddVisualizationCallback(update,+x)%3B%0A%0A++++Eigen::VectorXd+x_init(2)%3B%0A++++x_init+%3C%3C+4,+5%3B%0A++++drake::solvers::Solve(prog,+x_init)%3B%0A++++return+0%3B%0A++%7D%0A'),l:'5',n:'0',o:'C%2B%2B+source+%231',t:'0')),k:54.063974829575244,l:'4',n:'0',o:'',s:0,t:'0'),(g:!((h:compiler,i:(compiler:g9,filters:(b:'0',binary:'1',commentOnly:'0',demangle:'0',directives:'0',execute:'0',intel:'0',libraryCode:'0',trim:'1'),flagsViewOpen:'1',fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,libs:!((name:eigen,ver:'337'),(name:drake,ver:'110')),options:'-std%3Dc%2B%2B17',selection:(endColumn:1,endLineNumber:1,positionColumn:1,positionLineNumber:1,selectionStartColumn:1,selectionStartLineNumber:1,startColumn:1,startLineNumber:1),source:1,tree:'1'),l:'5',n:'0',o:'g%2B%2B+9+(C%2B%2B,+Editor+%231,+Compiler+%231)',t:'0'),(h:output,i:(compiler:1,editor:1,fontScale:14,fontUsePx:'0',tree:'1',wrap:'1'),l:'5',n:'0',o:'Output+of+g%2B%2B+9+(Compiler+%231)',t:'0')),k:45.936025170424756,l:'4',m:100,n:'0',o:'',s:1,t:'0')),l:'2',n:'0',o:'',t:'0')),version:4">here</a>.
</p>
</div>
</div>

<div id="outline-container-org3051a1c" class="outline-2">
<h2 id="org3051a1c">Advanced tutorials</h2>
<div class="outline-text-2" id="text-org3051a1c">
<p>
Setting solver parameters
</p>

<p>
Updating costs and constraints(e.g.for efficient solving of many similar programs)
</p>

<p>
Debugging tips
</p>

<p>
Linear program
</p>

<p>
Quadratic program
</p>

<p>
Nonlinear program
</p>

<p>
Sum-of-squares optimization
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
